turbinesFoam/tests/leishmanBeddoes/rotor/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

// The former crash point is the first PIMPLE iteration at t = 0.008 s
// (deltaT = 0.008). Two steps prove the run passes it and continues.
endTime         0.016;

deltaT          0.008;

writeControl    timeStep;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

libs
(
    "libturbinesFoam.so"
);

functions
{
    forceIntegral
    {
        type            volFieldValue;
        libs            ("libfieldFunctionObjects.so");
        fields          (force.turbine);
        operation       volIntegrate;
        writeFields     false;
    }
}

// ************************************************************************* //
